read_verilog -formal circuit_2.v
prep -top top
synth -flatten
aigmap
write_aiger circuit_2.aig